### Look at the end of the notebook... I'm a pepega

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
columns = ["age", "workclass", "fnlwgt", "education", "education-num", "marital-status",
           "occupation", "relationship", "race", "sex", "capital-gain", "capital-loss",
           "hours-per-week", "native-country", "salary"]

adult = pd.read_csv("datasets/adult/adult.data", names=columns)
adult.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [3]:
adult.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [4]:
adult.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [5]:
adult.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
salary            0
dtype: int64

#### How many men and women (sex feature) are represented in this dataset?

In [6]:
adult["sex"].value_counts()

 Male      21790
 Female    10771
Name: sex, dtype: int64

#### What is the average age (age feature) of women?

In [7]:
adult[adult["sex"].str.contains("Female")]["age"].mean()

36.85823043357163

In [8]:
adult.groupby(["sex"]).mean()["age"]

sex
 Female    36.858230
 Male      39.433547
Name: age, dtype: float64

#### What is the percentage of German citizens (native-country feature)?

In [9]:
adult["native-country"].value_counts().index

Index([' United-States', ' Mexico', ' ?', ' Philippines', ' Germany',
       ' Canada', ' Puerto-Rico', ' El-Salvador', ' India', ' Cuba',
       ' England', ' Jamaica', ' South', ' China', ' Italy',
       ' Dominican-Republic', ' Vietnam', ' Guatemala', ' Japan', ' Poland',
       ' Columbia', ' Taiwan', ' Haiti', ' Iran', ' Portugal', ' Nicaragua',
       ' Peru', ' France', ' Greece', ' Ecuador', ' Ireland', ' Hong',
       ' Cambodia', ' Trinadad&Tobago', ' Laos', ' Thailand', ' Yugoslavia',
       ' Outlying-US(Guam-USVI-etc)', ' Honduras', ' Hungary', ' Scotland',
       ' Holand-Netherlands'],
      dtype='object')

In [10]:
(adult["native-country"].value_counts()[' Germany'] / adult["native-country"].value_counts().sum()) * 100

0.42074874850281013

#### What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?

In [11]:
adult.groupby(["salary"]).mean() # we can add ["age"] after .mean()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
salary,,,,,,
<=50K,36.783738,190340.86517,9.595065,148.752468,53.142921,38.840210
>50K,44.249841,188005.00000,11.611657,4006.142456,195.001530,45.473026

In [12]:
adult.groupby(["salary"]).std()["age"]

salary
 <=50K    14.020088
 >50K     10.519028
Name: age, dtype: float64

#### Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)

In [13]:
adult[adult["salary"].str.contains(">50K")]["education"].unique()

array([' HS-grad', ' Masters', ' Bachelors', ' Some-college',
       ' Assoc-voc', ' Doctorate', ' Prof-school', ' Assoc-acdm',
       ' 7th-8th', ' 12th', ' 10th', ' 11th', ' 9th', ' 5th-6th',
       ' 1st-4th'], dtype=object)

#### Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.

In [14]:
adult.groupby(["race", "sex"]).describe()["age"]

                               count       mean        std   min   25%   50%  \
race                sex
 Amer-Indian-Eskimo  Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                     Male      192.0  37.208333  12.049563  17.0  28.0  35.0
 Asian-Pac-Islander  Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                     Male      693.0  39.073593  12.883944  18.0  29.0  37.0
 Black               Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                     Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
 Other               Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                     Male      162.0  34.654321  11.355531  17.0  26.0  32.0
 White               Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                     Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                               75%   max
race                sex
 Amer-Indian-Eskimo  Female  46.00  80.0
                     Male    45.00  82.0
 Asian-Pac-Islander  Female  43.75  75.0
                     Male    46.00  90.0
 Black               Female  46.00  90.0
                     Male    46.00  90.0
 Other               Female  39.00  74.0
                     Male    42.00  77.0
 White               Female  46.00  90.0
                     Male    49.00  90.0

#### Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.

In [15]:
adult["marital-status"].value_counts() # We can also use .unique(), however np array does not have index.str attr..

 Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: marital-status, dtype: int64

In [16]:
married_mask = adult["marital-status"].value_counts().index.str.contains(" Married")
adult[adult["salary"].str.contains(">50K")]["marital-status"].value_counts()[married_mask]

 Married-civ-spouse       6692
 Married-spouse-absent      34
 Married-AF-spouse          10
Name: marital-status, dtype: int64

In [17]:
adult[adult["salary"].str.contains(">50K")]["marital-status"].value_counts()[~married_mask] # '~' operator works fine on boolean arrays

 Never-married    491
 Divorced         463
 Widowed           85
 Separated         66
Name: marital-status, dtype: int64

#### What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [18]:
max_hours = adult["hours-per-week"].max()
max_hours

99

In [19]:
people_ = adult[adult["hours-per-week"] == max_hours]
len(people_)  # 85 people, we can also use people_.shape and see the number of rows/examples (people)

85

In [20]:
rich_people = people_[people_["salary"].str.contains(">50K")]
(len(rich_people) / len(people_)) * 100

29.411764705882355

#### Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?

In [21]:
countries_ = adult.groupby(["native-country", "salary"]).mean()
countries_

                             age         fnlwgt  education-num  capital-gain  \
native-country salary
 ?              <=50K  36.853547  195354.379863      10.038902    113.757437
                >50K   44.328767  187154.513699      12.273973   6873.205479
 Cambodia       <=50K  35.666667  167065.666667       7.916667    498.250000
                >50K   41.428571  237677.000000      10.285714   1935.714286
 Canada         <=50K  41.012195  169279.585366      10.243902    110.695122
...                          ...            ...            ...           ...
 United-States  >50K   44.297169  187433.992330      11.578859   3967.286850
 Vietnam        <=50K  33.951613  165028.725806       9.661290    240.193548
                >50K   35.400000  141648.400000       9.600000   5873.600000
 Yugoslavia     <=50K  38.000000  227306.800000       9.700000      0.000000
                >50K   40.166667  197059.166667      10.333333    926.000000

                       capital-loss  hours-per-week
native-country salary
 ?              <=50K     62.427918       40.164760
                >50K     285.397260       45.547945
 Cambodia       <=50K    289.833333       41.416667
                >50K       0.000000       40.000000
 Canada         <=50K    145.524390       37.914634
...                             ...             ...
 United-States  >50K     194.465207       45.505369
 Vietnam        <=50K     94.338710       37.193548
                >50K       0.000000       39.200000
 Yugoslavia     <=50K      0.000000       41.600000
                >50K       0.000000       49.500000

[82 rows x 6 columns]

In [22]:
countries_.loc[' Japan', ' <=50K']["hours-per-week"]

41.0

In [23]:
countries_.loc[' Japan', ' >50K']["hours-per-week"]

47.958333333333336

## I'm a pepega XD.... Do you want to know why?

Remember that indexes have an ' ' space char at the first of the value, e.g " Japan"

In [24]:
adult[adult["sex"] == " Female"]

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
12,23,Private,122272,Bachelors,13,Never-married,Adm-clerical,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32546,37,Private,198216,Assoc-acdm,12,Divorced,Tech-support,Not-in-family,White,Female,0,0,40,United-States,<=50K
32549,43,State-gov,255835,Some-college,10,Divorced,Adm-clerical,Other-relative,White,Female,0,0,40,United-States,<=50K
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

I'm really a pepega clap :'v. As I said before, there is a space char " " at the beginning of the string type value (not only for indexes in a serie...well, those indexes are string values too xd)

In [25]:
adult["sex"].value_counts()

 Male      21790
 Female    10771
Name: sex, dtype: int64

Look at the first of each value (Male and Female), we can notice there is a " " space char >:v